Locked-Inc/STAR/e2-studio-star-rx72n-firmware/src/hardware_init.c
  err = rx_mpc_set_rspi((rx_port_pin_t)k_pin_host_cs0);
  RX_RETURN_ON_ERROR(err, s_tag, "RSPI2 CS0 pin config failed");

  return k_rx_ok;
}

/**
 * @brief Configure MTU encoder input pins (front wheels)
 *
 * @details
 * Configures MPC pin multiplexing for MTU external clock inputs MTCLKA-MTCLKD
 * on P2.4/P2.5/PA.1/PC.5. Enables pulse counter mode for quadrature encoder
 * inputs from front wheel motors.
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok All pins configured successfully
 * @retval k_rx_err_hw_init_failed MPC configuration failed for one or more pins
 *
 * @pre MPC write protection disabled (PWPR.B0WI=0, PWPR.PFSWE=1)
 * @pre Pins not in use by other peripherals
 * @post P2.4/P2.5 configured as MTCLKA/MTCLKB
 * @post PA.1/PC.5 configured as MTCLKC/MTCLKD
 *
 * @note Thread-safe. No shared state modified.
 * @note Called only during system initialization.
 *
 * @since Version 1.0.0
 */
static rx_err_t internal_gpio_init_mtu_encoders(void)
{
  static const char* s_tag = "GPIO_MTU_ENC";

  rx_err_t err = rx_mpc_set_mtu_encoder((rx_port_pin_t)k_pin_enc0_pha);
  RX_RETURN_ON_ERROR(err, s_tag, "MTCLKA pin config failed");

  err = rx_mpc_set_mtu_encoder((rx_port_pin_t)k_pin_enc0_phb);
  RX_RETURN_ON_ERROR(err, s_tag, "MTCLKB pin config failed");

  err = rx_mpc_set_mtu_encoder((rx_port_pin_t)k_pin_enc1_pha);
  RX_RETURN_ON_ERROR(err, s_tag, "MTCLKC pin config failed");

  err = rx_mpc_set_mtu_encoder((rx_port_pin_t)k_pin_enc1_phb);
  RX_RETURN_ON_ERROR(err, s_tag, "MTCLKD pin config failed");

  return k_rx_ok;
}

/**
 * @brief Configure TPU encoder input pins (rear wheels)
 *
 * @details
 * Configures MPC pin multiplexing for TPU external clock inputs TCLKA-TCLKD
 * on PC.2/PA.3/PC.0/PB.3. Enables pulse counter mode for quadrature encoder
 * inputs from rear wheel motors.
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok All pins configured successfully
 * @retval k_rx_err_hw_init_failed MPC configuration failed for one or more pins
 *
 * @pre MPC write protection disabled (PWPR.B0WI=0, PWPR.PFSWE=1)
 * @pre Pins not in use by other peripherals
 * @post PC.2/PA.3 configured as TCLKA/TCLKB
 * @post PC.0/PB.3 configured as TCLKC/TCLKD
 *
 * @note Thread-safe. No shared state modified.
 * @note Called only during system initialization.
 *
 * @since Version 1.0.0
 */
static rx_err_t internal_gpio_init_tpu_encoders(void)
{
  static const char* s_tag = "GPIO_TPU_ENC";

  rx_err_t err = rx_mpc_set_tpu_encoder((rx_port_pin_t)k_pin_enc2_pha);
  RX_RETURN_ON_ERROR(err, s_tag, "TCLKA pin config failed");

  err = rx_mpc_set_tpu_encoder((rx_port_pin_t)k_pin_enc2_phb);
  RX_RETURN_ON_ERROR(err, s_tag, "TCLKB pin config failed");

  err = rx_mpc_set_tpu_encoder((rx_port_pin_t)k_pin_enc3_pha);
  RX_RETURN_ON_ERROR(err, s_tag, "TCLKC pin config failed");

  err = rx_mpc_set_tpu_encoder((rx_port_pin_t)k_pin_enc3_phb);
  RX_RETURN_ON_ERROR(err, s_tag, "TCLKD pin config failed");

  return k_rx_ok;
}

/**
 * @brief Configure GPTW PWM output pins (4 motors)
 *
 * @details
 * Configures MPC pin multiplexing for GPTW0-GPTW3 PWM outputs distributed
 * across PORT2, PORT1, PORT8, PORTC, and PORTE. Sets PSEL for all 8 pins
 * (4 motors x IN2+IN1 per motor) for DRV8263H motor driver control.
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok All pins configured successfully
 * @retval k_rx_err_hw_init_failed MPC configuration failed for one or more pins
 *
 * @pre MPC write protection disabled (PWPR.B0WI=0, PWPR.PFSWE=1)
 * @pre Pins not in use by other peripherals
 * @post P23/P17, P22/PC3, PE3/P86, PE7/PC6 configured as GPTW outputs
 * @post All 8 GPTW PWM pins ready for motor control
 *
 * @note Thread-safe. No shared state modified.
 * @note Called only during system initialization.
 *
 * @since Version 1.0.0
 */
static rx_err_t internal_gpio_init_gptw_pwm(void)
{
  static const char* s_tag = "GPIO_GPTW";

  const rx_port_pin_t gptw_pins[] = {(rx_port_pin_t)k_pin_motor0_in2,
                                     (rx_port_pin_t)k_pin_motor0_in1,
                                     (rx_port_pin_t)k_pin_motor1_in2,
                                     (rx_port_pin_t)k_pin_motor1_in1,
                                     (rx_port_pin_t)k_pin_motor2_in2,
                                     (rx_port_pin_t)k_pin_motor2_in1,
                                     (rx_port_pin_t)k_pin_motor3_in2,
                                     (rx_port_pin_t)k_pin_motor3_in1};

  for (uint8_t i = 0; i < k_gptw_pin_count; i++) {
    const rx_err_t err = rx_mpc_set_gptw(gptw_pins[i]);
    RX_RETURN_ON_ERROR(err, s_tag, "GPTW pin config failed");
  }

  return k_rx_ok;
}

/**
 * @brief Configure a single GPIO pin as output with initial level
 *
 * @details
 * Sets the given pin to GPIO mode (PMR cleared), drives the specified
 * initial logic level on PODR, and configures PDR as output. This is a
 * common pattern used by DRVOFF, nSLEEP, sonar trigger, and IMU reset pins.
 *
 * @param[in] port_pin Encoded port/pin value from hardware_config.h
 * @param[in] initial_high True to drive HIGH on startup, false for LOW
 *
 * @pre Pin must have MPC already configured via rx_mpc_set_gpio()
 * @pre Port base address must be valid for the given pin
 * @post Pin configured as GPIO output at the requested level
 *
 * @note Thread-safe. No shared state modified.
 *
 * @since Version 1.2.0
 */
static inline void internal_gpio_set_output(rx_port_pin_t port_pin, bool initial_high)
{
  const uint8_t            port = rx_port_from_pin(port_pin);
  const uint8_t            pin  = rx_pin_from_pin(port_pin);
  volatile rx_port_regs_t* regs = rx_port_get_base(port);
  RX_ASSERT(regs != nullptr, "Invalid GPIO port for output pin");
  regs->pmr &= ~(uint8_t)(1U << pin); /* GPIO mode */
  if (initial_high) {
    regs->podr |= (uint8_t)(1U << pin);
  } else {
    regs->podr &= ~(uint8_t)(1U << pin);
  }
  regs->pdr |= (uint8_t)(1U << pin); /* Output direction */
}

/**
 * @brief Configure a single GPIO pin as input
 *
 * @details
 * Sets the given pin to GPIO mode (PMR cleared) and configures PDR as
 * input. Used by IMU interrupt and sonar echo pins.
 *
 * @param[in] port_pin Encoded port/pin value from hardware_config.h
 *
 * @pre Pin must have MPC already configured via rx_mpc_set_gpio()
 * @pre Port base address must be valid for the given pin
 * @post Pin configured as GPIO input
 *
 * @note Thread-safe. No shared state modified.
 *
 * @since Version 1.2.0
 */
static inline void internal_gpio_set_input(rx_port_pin_t port_pin)
{
  const uint8_t            port = rx_port_from_pin(port_pin);
  const uint8_t            pin  = rx_pin_from_pin(port_pin);
  volatile rx_port_regs_t* regs = rx_port_get_base(port);
  RX_ASSERT(regs != nullptr, "Invalid GPIO port for input pin");
  regs->pmr &= ~(uint8_t)(1U << pin); /* GPIO mode */
  regs->pdr &= ~(uint8_t)(1U << pin); /* Input direction */
}

/**
 * @brief Configure IMU pins (RIIC1 I2C + GPIO interrupt and reset)
 *
 * @details
 * Configures 4 pins for the inertial measurement unit:
 * - P2.1/SCL1 and P2.0/SDA1: RIIC1 I2C bus for IMU communication
 * - P3.2: IMU interrupt input (active-low)
 * - P8.3: IMU reset output (active-low, initialized HIGH = not in reset)
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok All pins configured successfully
 * @retval k_rx_err_hw_init_failed MPC configuration failed for one or more pins
 *
 * @pre MPC write protection disabled (PWPR.B0WI=0, PWPR.PFSWE=1)
 * @pre Pins not in use by other peripherals
 * @post P2.1 configured as SCL1, P2.0 configured as SDA1
 * @post P3.2 configured as GPIO input, P8.3 configured as GPIO output HIGH
 *
 * @note Thread-safe. No shared state modified.
 * @note Called only during system initialization.
 *
 * @since Version 1.1.0
 */
static rx_err_t internal_gpio_init_imu(void)
{
  static const char* s_tag = "GPIO_IMU";

