Locked-Inc/STAR/e2-studio-star-rx72n-firmware/src/hardware_init.c
  /* IMU I2C (RIIC1): SCL1 + SDA1 */
  rx_err_t err = rx_mpc_set_riic((rx_port_pin_t)k_pin_imu_scl);
  RX_RETURN_ON_ERROR(err, s_tag, "SCL1 pin config failed");

  err = rx_mpc_set_riic((rx_port_pin_t)k_pin_imu_sda);
  RX_RETURN_ON_ERROR(err, s_tag, "SDA1 pin config failed");

  /* IMU INT: GPIO input (active-low interrupt from IMU) */
  err = rx_mpc_set_gpio((rx_port_pin_t)k_pin_imu_int);
  RX_RETURN_ON_ERROR(err, s_tag, "IMU INT MPC config failed");

  internal_gpio_set_input((rx_port_pin_t)k_pin_imu_int);

  /* IMU RST: GPIO output, initial HIGH (not in reset) */
  err = rx_mpc_set_gpio((rx_port_pin_t)k_pin_imu_rst);
  RX_RETURN_ON_ERROR(err, s_tag, "IMU RST MPC config failed");

  internal_gpio_set_output((rx_port_pin_t)k_pin_imu_rst, true); /* HIGH = not in reset */

  return k_rx_ok;
}

/**
 * @brief Configure DRV8263H motor driver control pins (DRVOFF + nSLEEP)
 *
 * @details
 * Configures 8 GPIO output pins for DRV8263H motor driver control:
 * - 4x DRVOFF pins: Output HIGH (driver outputs disabled for safe startup)
 * - 4x nSLEEP pins: Output HIGH (driver awake, not in sleep mode)
 *
 * Motor outputs remain disabled (DRVOFF=HIGH) until explicitly enabled.
 * TODO(#367): Motor control task must drive DRVOFF LOW before commanding PWM.
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok All pins configured successfully
 * @retval k_rx_err_hw_init_failed MPC configuration failed for one or more pins
 *
 * @pre MPC write protection disabled (PWPR.B0WI=0, PWPR.PFSWE=1)
 * @pre Pins not in use by other peripherals
 * @post All 4 DRVOFF pins configured as GPIO outputs, driven HIGH (disabled)
 * @post All 4 nSLEEP pins configured as GPIO outputs, driven HIGH
 *
 * @note Thread-safe. No shared state modified.
 * @note Called only during system initialization.
 *
 * @since Version 1.1.0
 */
static rx_err_t internal_gpio_init_motor_driver_ctrl(void)
{
  static const char* s_tag = "GPIO_DRV_CTRL";

  const rx_port_pin_t drvoff_pins[k_motor_count] = {(rx_port_pin_t)k_pin_motor0_drvoff,
                                                     (rx_port_pin_t)k_pin_motor1_drvoff,
                                                     (rx_port_pin_t)k_pin_motor2_drvoff,
                                                     (rx_port_pin_t)k_pin_motor3_drvoff};

  const rx_port_pin_t nsleep_pins[k_motor_count] = {(rx_port_pin_t)k_pin_motor0_nsleep,
                                                     (rx_port_pin_t)k_pin_motor1_nsleep,
                                                     (rx_port_pin_t)k_pin_motor2_nsleep,
                                                     (rx_port_pin_t)k_pin_motor3_nsleep};

  /* Configure DRVOFF pins as GPIO outputs, drive HIGH (outputs disabled for safe startup) */
  for (uint8_t i = 0; i < k_motor_count; i++) {
    const rx_err_t err = rx_mpc_set_gpio(drvoff_pins[i]);
    RX_RETURN_ON_ERROR(err, s_tag, "DRVOFF MPC config failed");
    internal_gpio_set_output(drvoff_pins[i], true); /* HIGH = outputs disabled */
  }

  /* Configure nSLEEP pins as GPIO outputs, drive HIGH (awake) */
  for (uint8_t i = 0; i < k_motor_count; i++) {
    const rx_err_t err = rx_mpc_set_gpio(nsleep_pins[i]);
    RX_RETURN_ON_ERROR(err, s_tag, "nSLEEP MPC config failed");
    internal_gpio_set_output(nsleep_pins[i], true); /* HIGH = awake */
  }

  return k_rx_ok;
}

/**
 * @brief Configure ADC current sense input pins
 *
 * @details
 * Configures MPC pin multiplexing for S12AD0 analog inputs AN004-AN007 on
 * P4.4-P4.7. Disables digital input buffers and sets pins to analog mode for
 * motor current sensing.
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok All pins configured successfully
 * @retval k_rx_err_hw_init_failed MPC configuration failed for one or more pins
 *
 * @pre MPC write protection disabled (PWPR.B0WI=0, PWPR.PFSWE=1)
 * @pre Pins not in use by other peripherals
 * @post P4.4-P4.7 configured as AN004-AN007 analog inputs
 * @post ADC pins ready for current sensing
 *
 * @note Thread-safe. No shared state modified.
 * @note Called only during system initialization.
 *
 * @since Version 1.0.0
 */
static rx_err_t internal_gpio_init_adc(void)
{
  static const char* s_tag = "GPIO_ADC";

  rx_err_t err = rx_mpc_set_adc((rx_port_pin_t)k_pin_adc_an004);
  RX_RETURN_ON_ERROR(err, s_tag, "AN004 pin config failed");

  err = rx_mpc_set_adc((rx_port_pin_t)k_pin_adc_an005);
  RX_RETURN_ON_ERROR(err, s_tag, "AN005 pin config failed");

  err = rx_mpc_set_adc((rx_port_pin_t)k_pin_adc_an006);
  RX_RETURN_ON_ERROR(err, s_tag, "AN006 pin config failed");

  err = rx_mpc_set_adc((rx_port_pin_t)k_pin_adc_an007);
  RX_RETURN_ON_ERROR(err, s_tag, "AN007 pin config failed");

  return k_rx_ok;
}

/**
 * @brief Configure USB VBUS detection pin
 *
 * @details
 * Configures MPC pin multiplexing for USB0_VBUS detection on P1.6.
 * Enables USB peripheral to detect host connection via VBUS voltage level.
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok All pins configured successfully
 * @retval k_rx_err_hw_init_failed MPC configuration failed for one or more pins
 *
 * @pre MPC write protection disabled (PWPR.B0WI=0, PWPR.PFSWE=1)
 * @pre Pins not in use by other peripherals
 * @post P1.6 configured as USB0_VBUS input
 * @post USB VBUS detection enabled
 *
 * @note Thread-safe. No shared state modified.
 * @note Called only during system initialization.
 *
 * @since Version 1.0.0
 */
static rx_err_t internal_gpio_init_usb(void)
{
  static const char* s_tag = "GPIO_USB";

  rx_err_t err = rx_mpc_set_usb_vbus((rx_port_pin_t)k_pin_usb_vbus);
  RX_RETURN_ON_ERROR(err, s_tag, "USB VBUS pin config failed");

  return k_rx_ok;
}

/**
 * @brief Configure HC-SR04 sonar trigger pins (GPIO outputs)
 *
 * @details
 * Configures 4 sonar trigger pins as GPIO outputs with initial LOW state.
 * Pins: PF5, PJ5, PJ3, P33. Used to trigger ultrasonic pulse transmission
 * on HC-SR04 distance sensors.
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok All pins configured successfully
 * @retval k_rx_err_hw_init_failed MPC configuration failed for one or more pins
 *
 * @pre MPC write protection disabled (PWPR.B0WI=0, PWPR.PFSWE=1)
 * @pre Pins not in use by other peripherals
 * @post All 4 sonar trigger pins configured as GPIO outputs
 * @post Trigger pins initialized to LOW (idle state)
 *
 * @note Thread-safe. No shared state modified.
 * @note Called only during system initialization.
 *
 * @since Version 1.0.0
 */
static rx_err_t internal_gpio_init_sonar_triggers(void)
{
  static const char* s_tag = "GPIO_SONAR_TRIG";

  const rx_port_pin_t sonar_trig_pins[k_sonar_count] = {(rx_port_pin_t)k_pin_sonar_trig0,
                                                        (rx_port_pin_t)k_pin_sonar_trig1,
                                                        (rx_port_pin_t)k_pin_sonar_trig2,
                                                        (rx_port_pin_t)k_pin_sonar_trig3};

